Revit 2026 API

# SketchPlaneCreate(Document, Plane) Method

---

Creates a new sketch plane from a geometric plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static SketchPlane Create(
	Document document,
	Plane plane
)
```
```vb
Public Shared Function Create (
	document As Document,
	plane As Plane
) As SketchPlane
```
```cpp
public:
static SketchPlane^ Create(
	Document^ document,
	Plane^ plane
)
```
```fsharp
static member Create :
        document : Document *
        plane : Plane -> SketchPlane
```

#### Parameters

document Document
     The document.
plane Plane
     The geometry plane where the sketch plane will be created.

#### Return Value

SketchPlane The newly created sketch plane.

| Exception | Condition |
| --- | --- |
| ArgumentException | Sketch plane creation is not allowed in this family. |
| ArgumentNullException | A non-optional argument was null |
| ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

There will not be a reference relationship established from the sketch plane to the input face. To create a SketchPlane with a reference to other geometry, use the overload with a Reference input.

#### Reference

SketchPlane Class

Create Overload

Autodesk.Revit.DB Namespace